rsnakin/esp8266Meteo/src/esp8266Meteo.cpp
/*
MIT License

Copyright (c) 2025 Richard Snakin

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE.
*/

#include <Adafruit_BMP085.h>
#include <Arduino.h>
#include <user_interface.h>
#include <DFRobot_DHT11.h>
#include <DallasTemperature.h>
#include <ESP8266WiFi.h>
#include <ESPAsyncWebServer.h>
#include <ESP8266mDNS.h>
#include <FS.h>
#include <LittleFS.h>
#include <OneWire.h>
#include <UniversalTelegramBot.h>
#include <WiFiClientSecure.h>
#include <ctime>
#include <ArduinoOTA.h>
#include "secret.h"
#include "TrendTracker.h"
#include "esp8266Meteo.h"

time_t            logTime;
time_t            startTime;
float             DS18B20Temp;
float             BMP180Temp;
float             BMP180Pressure;
float             BMP180PressureMM;
byte              sensor = DS18B20;
byte              gHumidity;
int               greenLed;
int               DHThumidity;
int               DHThumidityRealValue;
int               DHTTemp;
char              startBuffer[32];
char              lastReadTimeBuffer[32];
char              sensorName[10];
unsigned long int readDataCounter = 0;
unsigned long int runTime;
unsigned long int lastReadDataTime = 0;
unsigned long int userMessages = 0;
WiFiClientSecure  netClient;
DFRobot_DHT11     DHT;
IPAddress         myIP;
Adafruit_BMP085   bmp;
DeviceAddress     temperatureSensors[3];
TrendTracker      trendTemperature;
TrendTracker      trendPressure;
TrendTracker      trendHumidity;
char              SSID[128];

OneWire oneWire(ONE_WIRE_BUS);
DallasTemperature sensors(&oneWire);
AsyncWebServer server(80);
#if SECURE_CLIENT == 1
X509List cert(TELEGRAM_CERTIFICATE_ROOT);
#endif
UniversalTelegramBot bot(BOT_TOKEN, netClient);
ADC_MODE(ADC_VCC);

/*######################################################################################*/

void connectWiFi() {
	WiFi.mode(WIFI_STA);
	WiFi.setHostname(HOSTNAME);
	WiFi.setSleep(false);
	WiFi.setAutoReconnect(true);
	int n = WiFi.scanNetworks(false, false);

	int bestCred = -1;
  	int bestRSSI = -127;

	for (int i = 0; i < n; i++) {
		String ssidFound = WiFi.SSID(i);
		for (size_t c = 0; c < WIFI_CREDENTIALS_COUNT; c++) {
			if (ssidFound.equals(WIFI_CREDENTIALS[c].ssid)) {
				int rssiFound = WiFi.RSSI(i);
				if (rssiFound > bestRSSI) {
					bestRSSI = rssiFound;
					bestCred = c;
				}
			}
		}
	}

	if (bestCred >= 0) {
		snprintf(SSID, sizeof(SSID), "%s", WIFI_CREDENTIALS[bestCred].ssid);
		snprintf(SSID, sizeof(SSID), "%s", strupr(SSID));
		WiFi.begin(WIFI_CREDENTIALS[bestCred].ssid, WIFI_CREDENTIALS[bestCred].pass);
	}

	while (WiFi.status() != WL_CONNECTED) {
		delay(250);
#if SERIAL_OUT == 1
		Serial.print(".");
#endif
	}

}

/*######################################################################################*/

bool isRainLikely() {
    float pressureSlope = TrendTracker_getSlope(&trendPressure);
    float tempSlope = TrendTracker_getSlope(&trendTemperature);

    if (
        (pressureSlope < -0.03f && DHThumidity > 65.0f) || 
        (pressureSlope < -0.01f && DHThumidity > 60.0f && tempSlope < 0.0f) ||
        (pressureSlope <= 0.0f && DHThumidity > 90.0)
    ) return true;
    return false;
}

/*######################################################################################*/

void setThresholds() {

    static float tTemperature = 0;
    static float tPressure = 0;
    static float tHumidity = 0;

    static unsigned long lastExec = 0;

    if(lastExec && millis() - lastExec < 300000UL) return;
    lastExec = millis();

    File tFile = LittleFS.open(THRESHOLD_DATA, "r");

    if (!tFile) {
        trendTemperature.threshold = TEMPERATURE_THRESHOLD;
        trendPressure.threshold = PRESSURE_THRESHOLD;
        trendHumidity.threshold = HUMIDITY_THRESHOLD;
        if(
            trendTemperature.threshold != tTemperature || 
            trendPressure.threshold != tPressure ||
            trendHumidity.threshold != tHumidity
        ) {
            char data[128];
            snprintf(data, sizeof(data), "{\"M\":\"Set default thresholds: T=%.3f, P=%.3f, H=%.3f\"}",
                trendTemperature.threshold, trendPressure.threshold, trendHumidity.threshold
            );
        }
        return;
    }

    auto parseLine = [](const char *&p) -> float {
        while (*p == '\r' || *p == '\n') ++p;

        char buf[32];
        size_t i = 0;
        while (*p && *p != '\n' && *p != '\r' && i < sizeof(buf) - 1)
            buf[i++] = *p++;
        buf[i] = '\0';

        while (*p == '\n' || *p == '\r') ++p;
        return strtof(buf, nullptr);
    };
    
    char buffer[32];
    size_t fileSize = tFile.size();

    tFile.readBytes(buffer, fileSize);
    buffer[fileSize] = '\0';
    const char *ptr = buffer;

    trendTemperature.threshold = *ptr ? parseLine(ptr) : TEMPERATURE_THRESHOLD;
    trendPressure.threshold    = *ptr ? parseLine(ptr) : PRESSURE_THRESHOLD;
    trendHumidity.threshold    = *ptr ? parseLine(ptr) : HUMIDITY_THRESHOLD;

    if(
        trendTemperature.threshold != tTemperature || 
        trendPressure.threshold != tPressure ||
        trendHumidity.threshold != tHumidity
    ) {
        tTemperature = trendTemperature.threshold;
        tPressure = trendPressure.threshold;
        tHumidity = trendHumidity.threshold;
        char data[128];
        snprintf(data, sizeof(data), "{\"M\":\"Got new thresholds: T=%.3f, P=%.3f, H=%.3f\"}",
            trendTemperature.threshold, trendPressure.threshold, trendHumidity.threshold
        );
        toLog(SYS_LOG, "IN", data);
    }

    tFile.close();
    delay(0);
}

