rsnakin/esp8266Meteo/src/esp8266Meteo.cpp
/*######################################################################################*/

void readData() {

    unsigned long int nowMills = millis();
    static bool firstTime = true;

    if (((nowMills - lastReadDataTime) < SENSORS_DELAY) && !firstTime) return;

    lastReadDataTime = millis();
    if (greenLed != 0) {
        digitalWrite(BLUE_PIN, HIGH);
    } else {
        digitalWrite(GREEN_PIN, HIGH);
    }

    if (sensor == DS18B20 || firstTime) {
        sensors.requestTemperatures();
        DS18B20Temp = sensors.getTempC(temperatureSensors[0]);
        TrendTracker_add(&trendTemperature, DS18B20Temp);
#if SERIAL_OUT == 1
        Serial.print(F("DS18B20Temp: "));
        Serial.println(DS18B20Temp);
#endif
    }

    if (sensor == BMP180 || firstTime) {
        BMP180Temp = bmp.readTemperature();
        BMP180Pressure = bmp.readPressure();
        BMP180PressureMM = BMP180Pressure * 0.00750063755419211;
        TrendTracker_add(&trendPressure, BMP180Pressure);
    }

    if (sensor == DHT11 || firstTime) {
        DHT.read(DHT11_PIN);
        DHThumidityRealValue = DHT.humidity;
        float humidity = DHThumidityRealValue * HUMIDITY_CORRECTION;
        if (humidity > 100.) humidity = 100.;
        TrendTracker_add(&trendHumidity, humidity);
        DHThumidity = static_cast<int>(humidity);
        DHTTemp = DHT.temperature;
    }

#if SERIAL_OUT == 1
    Serial.println(F("###############################"));
    if (firstTime) {
        Serial.println(F("SENSOR: ALL"));
    } else {
        Serial.print(F("SENSOR: "));
        Serial.println(sensor);
    }
    Serial.print(F("DS18B20Temp: "));
    Serial.println(DS18B20Temp);
    Serial.print(F("BMP180Temp: "));
    Serial.println(BMP180Temp);
    Serial.print(F("BMP180Pressure: "));
    Serial.println(BMP180Pressure);
    Serial.print(F("BMP180PressureMM: "));
    Serial.println(BMP180PressureMM);
    Serial.print(F("DHThumidity: "));
    Serial.println(DHThumidity);
    Serial.print(F("DHTTemp: "));
    Serial.println(DHTTemp);
#endif

    if (sensor == DS18B20) {
        memCopy(sensorName, "DS18B20", sizeof(sensorName));
        sensor = BMP180;
        runTime = millis() - nowMills;
        if (runTime > MAX2LOG_DS18B20 && !firstTime) {
            char data[128];
            snprintf(data, sizeof(data), "{\"RT\":\"%lu\",\"SN\":\"%s\"}", runTime, sensorName);
            toLog(SYS_LOG, "RS", data);
        }
    } else if (sensor == BMP180) {
        memCopy(sensorName, "BMP180", sizeof(sensorName));
        sensor = DHT11;
        runTime = millis() - nowMills;
        if (runTime > MAX2LOG_BMP180) {
            char data[128];
            snprintf(data, sizeof(data), "{\"RT\":\"%lu\",\"SN\":\"%s\"}", runTime, sensorName);
            toLog(SYS_LOG, "RS", data);
        }
    } else if (sensor == DHT11) {
        memCopy(sensorName, "DHT11", sizeof(sensorName));
        sensor = DS18B20;
        runTime = millis() - nowMills;
        if (runTime > MAX2LOG_DHT11) {
            char data[128];
            snprintf(data, sizeof(data), "{\"RT\":\"%lu\",\"SN\":\"%s\"}", runTime, sensorName);
            toLog(SYS_LOG, "RS", data);
        }
    }

    if (firstTime) memCopy(sensorName, "ALL", sizeof(sensorName));

    firstTime = false;
    time_t ltime;
    time(&ltime);
    snprintf(lastReadTimeBuffer, sizeof(lastReadTimeBuffer), "%s", ctime(&ltime));
    lastReadTimeBuffer[strlen(lastReadTimeBuffer) - 1] = '\0';

    readDataCounter++;

#if SERIAL_OUT == 1
    Serial.print(F("Reading run time: "));
    Serial.print(runTime);
    Serial.println(F(" msec"));
#endif

    if (greenLed != 0) {
        digitalWrite(BLUE_PIN, LOW);
    } else {
        digitalWrite(GREEN_PIN, LOW);
    }

    delay(0);

    return;
}

/*######################################################################################*/

String getContentType(String filename, AsyncWebServerRequest *request) {
    if(request->hasParam("download"))
        return "application/octet-stream";
    else if (filename.endsWith(".htm"))
        return "text/html";
    else if (filename.endsWith(".html"))
        return "text/html";
    else if (filename.endsWith(".css"))
        return "text/css";
    else if (filename.endsWith(".js"))
        return "application/javascript";
    else if (filename.endsWith(".png"))
        return "image/png";
    else if (filename.endsWith(".gif"))
        return "image/gif";
    else if (filename.endsWith(".jpg"))
        return "image/jpeg";
    else if (filename.endsWith(".ico"))
        return "image/x-icon";
    else if (filename.endsWith(".xml"))
        return "text/xml";
    else if (filename.endsWith(".pdf"))
        return "application/x-pdf";
    else if (filename.endsWith(".zip"))
        return "application/x-zip";
    else if (filename.endsWith(".gz"))
        return "application/x-gzip";
    return "text/plain";
}

/*######################################################################################*/

char* formatBytes(size_t bytes) {
    static char buf[2][20];
    static uint8_t idx = 0;

    const char* units[] = {"B", "KB", "MB", "GB"};
    double size = bytes;
    int unitIndex = 0;

    while (size >= 1024.0 && unitIndex < 3) {
        size /= 1024.0;
        ++unitIndex;
    }

    char* current = buf[idx];
    idx = (idx + 1) % 2;

    if (unitIndex == 0)
        snprintf(current, 20, "%u%s", (unsigned)bytes, units[unitIndex]);
    else
        snprintf(current, 20, "%.3f%s", size, units[unitIndex]);

    return current;
}

/*######################################################################################*/

void *memCopy(void *dest, const void *src, size_t n) {
    unsigned char *d = (unsigned char *)dest;
    const unsigned char *s = (const unsigned char *)src;
    for (size_t i = 0; i < n; i++) {
        d[i] = s[i];
    }
    return dest;
}

