rsnakin/esp8266Meteo/src/esp8266Meteo.cpp
/*######################################################################################*/

void diskUsage(AsyncWebServerRequest *request) {
    digitalWrite(BLUE_PIN, HIGH);

    FSInfo fs_info;
    LittleFS.info(fs_info);
    long usedBytes = 0;
    long totalBytes = fs_info.totalBytes;

    Dir dir = LittleFS.openDir("/");
    while (dir.next()) {
        usedBytes = usedBytes + dir.fileSize();
    }

    char buffer[256];
    snprintf(buffer, sizeof(buffer), "{\"T\":\"%s\",\"U\":\"%s\",\"TU\":\"%ld\",\"UU\":\"%ld\"}",
            formatBytes(totalBytes), 
            formatBytes(usedBytes),
            totalBytes,
            usedBytes
    );
#if SERIAL_OUT == 1
    Serial.print(F("diskUsage: "));
    Serial.println(buffer);
#endif

    request->send(200, "text/json", buffer);
    digitalWrite(BLUE_PIN, LOW);

    return;
}

/*######################################################################################*/

void logsList(AsyncWebServerRequest *request) {
    digitalWrite(BLUE_PIN, HIGH);

    int logNumber = 1;
    char logName[24];
    String output;
    output = "[";
    snprintf(logName, sizeof(logName), TMPL_LOG, logNumber);
    while (LittleFS.exists(logName)) {
        output += "{\"LN\":\"" + String(logName) + "\"},";
        logNumber++;
        snprintf(logName, sizeof(logName), TMPL_LOG, logNumber);
    }
    output += "{\"END\":\"NULL\"}]";
    request->send(200, "text/json", output);

    digitalWrite(BLUE_PIN, LOW);
    return;
}

/*######################################################################################*/

void clearLogs(AsyncWebServerRequest *request) {
    digitalWrite(BLUE_PIN, HIGH);

    int logNumber = 1;
    char logName[24];
    String output;
    output = "[";
    snprintf(logName, sizeof(logName), TMPL_LOG, logNumber);
    while (LittleFS.exists(logName)) {
        output += "{\"LN\":\"" + String(logName) + "\"},";
#if SERIAL_OUT == 1
        Serial.print(F("Deleted log: "));
        Serial.println(logName);
#endif
        LittleFS.remove(logName);
        char data[128];
        snprintf(data, sizeof(data), "{\"FL\":\"%s\"}", logName);
        toLog(SYS_LOG, "RM", data);
        logNumber++;
        snprintf(logName, sizeof(data), TMPL_LOG, logNumber);
    }
    output += "{\"END\":\"NULL\"}]";
    request->send(200, "text/json", output);

    digitalWrite(BLUE_PIN, LOW);
    return;
}

/*######################################################################################*/

void getLog(AsyncWebServerRequest *request) {
    digitalWrite(BLUE_PIN, HIGH);
    String path;
    if(request->hasParam("log")) {
        path = request->getParam("log")->value();
    } else {
        path = SYS_LOG;
#if SERIAL_OUT == 1
        Serial.println("Default getLog: " + path);
#endif
    }
    if (!LittleFS.exists(path)) {
#if SERIAL_OUT == 1
        Serial.println("Error getLog: [" + path + "]");
#endif
        request->send(200, "text/plain", "{\"E\":\"Log not found\"}");
        digitalWrite(BLUE_PIN, LOW);
        return;
    }
    File file = LittleFS.open(path, "r");
    request->send(LittleFS, path, "text/plain");
#if SERIAL_OUT == 1
    Serial.println("getLog: " + path);
#endif
    file.close();
    digitalWrite(BLUE_PIN, LOW);
    return;
}

/*######################################################################################*/

void handleFileDelete(AsyncWebServerRequest *request) {
    if (request->params() == 0) {
        request->send(500, "text/plain", "Invalid request");
        return;
    }
    String path = request->getParam((int)0)->value();
#if SERIAL_OUT == 1
    Serial.println("handleFileDelete: " + path);
#endif
    if (path == "/") {
        request->send(500, "text/plain", "Invalid file path");
        return;
    }
    if (!LittleFS.exists(path)) {
        request->send(500, "text/plain", "File not found");
        return;
    }
    LittleFS.remove(path);
    request->send(200, "text/plain", "");
    char data[128];
    snprintf(data, sizeof(data), "{\"FL\":\"%s\"}", path.c_str());
    toLog(SYS_LOG, "RM", data); // RM File deleted
}

/*######################################################################################*/

void handleFileList(AsyncWebServerRequest *request) {
    if (!request->hasParam("dir")) {
        request->send(500, "text/plain", "Incorrect arguments\r\n");
        return;
    }

    String path = request->getParam("dir")->value();
#if SERIAL_OUT == 1
    Serial.println("handleFileList: " + path);
#endif
    Dir dir = LittleFS.openDir(path);
    path = String();

    String output = "[";
    while (dir.next()) {
        File entry = dir.openFile("r");
        if (output != "[")
        output += ',';
        size_t fileSize;
        //char sizeFormatedBytes[20];
        fileSize = dir.fileSize();
        output += "{\"type\":\"";
        output += "file";
        output += "\",\"name\":\"";
        output += entry.name();
        output += "\",\"size\":\"";
        output += formatBytes(fileSize);
        output += "\"}";
        entry.close();
    }

    output += "]";
    request->send(200, "text/json", output);
}

/*######################################################################################*/

void getAllData(AsyncWebServerRequest *request) {
    digitalWrite(BLUE_PIN, HIGH);
    time_t ltime;
    time(&ltime);
    long int upTime = static_cast<long int>(ltime - startTime);

    int days  = upTime / 86400;
    int rem   = upTime % 86400;
    int hours = rem / 3600;
    rem       = rem % 3600;
    int mins  = rem / 60;
    int secs  = rem % 60;

    char curTime[32];
    snprintf(curTime, sizeof(curTime), "%s", ctime(&ltime));
    curTime[strlen(curTime) - 1] = '\0';

    float volts = ESP.getVcc() / 1000.0;

#if SERIAL_OUT == 1
    char SerialOut[] = "ON";
#else
    char SerialOut[] = "OFF";
#endif

    char response[1024];
    char __isRainLikely[] = RAIN_LIKELY;
    if (!isRainLikely()) {
        snprintf(__isRainLikely, sizeof(__isRainLikely), NO_RAIN_EXP);
    }

    uint32_t freeMem = ESP.getFreeHeap();

    snprintf(
        response, sizeof(response),
    "{\"DS18B20_t\":\"%s %+2.2f°C\",\"BMP180_t\":\"%+2.2f°C\",\"DHT11_t\":\"%+d°C\",\
    \"BMP180_p\":\"%s %2.2f mmHg (%2.3f kPa)\",\"DHT11_h\":\"%s %d%% (%d%%)\",\"version\":\"%s SerialOut:%s Build:%s\",\
    \"ip\":\"%d.%d.%d.%d\",\"uptime\":\"%d day(s) %02d:%02d:%02d\",\"time\":\"%s\",\"start_time\":\"%s\",\
    \"read_time\":\"%s\",\"read_counter\":\"%lu [%s: %lu msec]\",\"msgs\":\"%lu\",\"volts\":\"%2.3f V\",\
    \"freq\":\"%u MHz\", \"rain\":\"%s\",\"rssi\":\"%d dBm\",\"SSID\":\"%s\",\"freeMem\":\"%d\"}",
        TrendTracker_getArrow(&trendTemperature), DS18B20Temp, BMP180Temp, DHTTemp, 
        TrendTracker_getArrow(&trendPressure), BMP180PressureMM,
        BMP180Pressure / 1000, TrendTracker_getArrow(&trendHumidity), DHThumidity, DHThumidityRealValue,
        VERSION, SerialOut, BUILD, myIP[0], myIP[1], myIP[2], myIP[3], days,
        hours, mins, secs, curTime, startBuffer, lastReadTimeBuffer,
        readDataCounter, sensorName, runTime, userMessages,
        volts, ESP.getCpuFreqMHz(), __isRainLikely, WiFi.RSSI(), SSID, freeMem);
    request->send(200, "text/json", response);
    digitalWrite(BLUE_PIN, LOW);
}

