rsnakin/esp8266Meteo/src/esp8266Meteo.cpp
/*######################################################################################*/

void logAndLed(const char* u, char code, unsigned long rt) {
    char d[64];
    snprintf(d, sizeof(d), "{\"U\":\"@%s\",\"RT\":%lu,\"C\":\"%c\"}", u, rt, code);
    toLog(SYS_LOG, "SM", d);
    digitalWrite(BLUE_PIN, LOW);
}
/*######################################################################################*/

void handleNewMessages(int numNewMessages) {

    char buffer[1024];
    long int startT = millis();

    for (int i = 0; i < numNewMessages; i++) {
        userMessages++;
        digitalWrite(BLUE_PIN, HIGH);
        if (bot.messages[i].text == "/info") {
            time_t ltime;
            time(&ltime);
            snprintf(buffer, sizeof(buffer),
                    "<b>Version:</b> <code>%s</code>\n<b>SSID</b>: <code>%s</code>\n<b>IP</b>: "
                    "<code>%d.%d.%d.%d</code>\n<b>Time</b>: <code>%s</code>",
                    VERSION, SSID, myIP[0], myIP[1], myIP[2], myIP[3], ctime(&ltime));
#if SERIAL_OUT == 1
            Serial.println(buffer);
#endif
            bot.sendMessage(bot.messages[i].chat_id, buffer, "HTML");
            logAndLed(bot.messages[i].from_name.c_str(), 'i', millis() - startT);
            return;
        }
        if (bot.messages[i].text == "/meteo") {
            char __isRainLikely[] = RAIN_LIKELY;
            if (!isRainLikely()) {
                snprintf(__isRainLikely, sizeof(__isRainLikely), NO_RAIN_EXP);
            }
            snprintf(
                buffer, sizeof(buffer),
                "Hello, <b>%s</b>!\n<b>Temperature: %s</b> "
                "<code>%+2.2f°C</code>\n<b>Pressure: %s</b> <code>%2.2f mmHg "
                "(%2.3f kPa)</code>\n<b>Humidity: %s</b> <code>%d%%</code>\n%s",
                bot.messages[i].from_name.c_str(),
                TrendTracker_getArrow(&trendTemperature), DS18B20Temp,
                TrendTracker_getArrow(&trendPressure), BMP180PressureMM, BMP180Pressure / 1000,
                TrendTracker_getArrow(&trendHumidity), DHThumidity, __isRainLikely);
#if SERIAL_OUT == 1
            Serial.println(buffer);
#endif
            bot.sendMessage(bot.messages[i].chat_id, buffer, "HTML");
            logAndLed(bot.messages[i].from_name.c_str(), 'm', millis() - startT);
            return;
        }
        if(bot.messages[i].text == "/location") {
#if SERIAL_OUT == 1
            Serial.print(F("Long: "));
            Serial.println(LONGITUDE);
            Serial.print(F("Lat: "));
            Serial.println(LATITUDE);
#endif
            bot.sendLocation(bot.messages[i].chat_id, LATITUDE, LONGITUDE, 0);
            logAndLed(bot.messages[i].from_name.c_str(), 'l', millis() - startT);
            return;
        }

        memCopy(buffer,
            "<b>The following commands are available:</b>\n"
            "<code>/meteo</code> - show weather\n"
            "<code>/info</code> - show information about the bot\n"
            "<code>/location</code> - show weather station location information\n",
            sizeof(buffer)
        );

#if SERIAL_OUT == 1
        Serial.println(buffer);
#endif
        bot.sendMessage(bot.messages[i].chat_id, buffer, "HTML");
        logAndLed(bot.messages[i].from_name.c_str(), 'h', millis() - startT);
    }
    digitalWrite(BLUE_PIN, LOW);
    return;
}

/*######################################################################################*/

void createLog(const char *fileNamePath) {
    File fileToWrite = LittleFS.open(fileNamePath, "w");
    if (fileToWrite) {
        char printBuffer[512];
        time(&logTime);
        snprintf(
            printBuffer, sizeof(printBuffer),
            "{\"T\":\"%ld\",\"A\":\"SL\",\"D\":{\"LF\":\"%s\",\"B\":\"%s\"}}", 
            static_cast<long int>(logTime), fileNamePath, BUILD); // SL - Start Log
        fileToWrite.print(printBuffer);
        fileToWrite.close();
    }
}

/*######################################################################################*/

void toLog(const char *fileNamePath, const char *action, char *data) {
    File fileToWrite = LittleFS.open(fileNamePath, "a");
    if (fileToWrite) {
        if (fileToWrite.size() > MAX_LOG_SIZE) {
            fileToWrite.close();
            rotateLogs();
            createLog(SYS_LOG);
            toLog(SYS_LOG, action, data);
            return;
        }
        char printBuffer[512];
        time_t ltime;
        time(&ltime);
        int timeOffset = static_cast<long int>(ltime - logTime);
        snprintf(printBuffer, sizeof(printBuffer), ",{\"T\":\"%d\",\"A\":\"%s\",\"D\":%s}", timeOffset,
                action, data);
        fileToWrite.print(printBuffer);
        fileToWrite.close();
    }
    return;
}

/*######################################################################################*/

int getMaxLogNumber() {
    int maxLogNumber = 1;
    char currentLog[24];
    snprintf(currentLog, sizeof(currentLog), TMPL_LOG, maxLogNumber);
#if SERIAL_OUT == 1
    Serial.print(F("getMaxLogNumber "));
    Serial.println(currentLog);
#endif
    while (LittleFS.exists(currentLog)) {
        maxLogNumber++;
        snprintf(currentLog, sizeof(currentLog), TMPL_LOG, maxLogNumber);
#if SERIAL_OUT == 1
        Serial.print("getMaxLogNumber ");
        Serial.println(currentLog);
#endif
    }
    maxLogNumber--;
    return (maxLogNumber);
}

/*######################################################################################*/

void rotateLogs() {
    int maxLogNumber = getMaxLogNumber();
    int i;
#if SERIAL_OUT == 1
    Serial.print(F("maxLogNumber "));
    Serial.println(maxLogNumber);
#endif
    for (i = maxLogNumber; i > 0; i--) {
        char currentLog[24];
        snprintf(currentLog, sizeof(currentLog), TMPL_LOG, i);
        if (LittleFS.exists(currentLog)) {
        char nextLog[24];
        snprintf(nextLog, sizeof(nextLog), TMPL_LOG, i + 1);
#if SERIAL_OUT == 1
        Serial.print(F("currentLog: "));
        Serial.println(currentLog);
#endif
        LittleFS.rename(currentLog, nextLog);
        }
    }
    char currentLog1[24];
    snprintf(currentLog1, sizeof(currentLog1), TMPL_LOG, 1);
    LittleFS.rename(SYS_LOG, currentLog1);
#if SERIAL_OUT == 1
    Serial.println(F("rotateLogs finished..."));
#endif
}

