rsnakin/esp8266Meteo/src/esp8266Meteo.cpp
/*######################################################################################*/

const char* resetReasonToString(uint8 reason) {
    switch (reason) {
        case 0: return "Unknown";
        case 1: return "Power-on";
        case 2: return "Hardware watchdog";
        case 3: return "Exception";
        case 4: return "Software watchdog";
        case 5: return "Software restart";
        case 6: return "Deep sleep wake";
        case 7: return "External reset";
        default: return "Invalid";
   }
}

/*######################################################################################*/

void setup() {

    pinMode(BLUE_PIN, OUTPUT);
    pinMode(GREEN_PIN, OUTPUT);

    bool ledOnOff = true;
    Serial.begin(115200);
#if SERIAL_OUT == 1
    for (uint8_t t = 10; t > 0; t--) {
        Serial.printf("[SETUP] FIRST WAIT %d...\n", t);
        Serial.flush();
        if (ledOnOff) {
        digitalWrite(GREEN_PIN, HIGH);
        ledOnOff = false;
        } else {
        digitalWrite(GREEN_PIN, LOW);
        ledOnOff = true;
        }
        delay(1000);
    }
    Serial.println(F("#### START ####"));
#endif

    digitalWrite(BLUE_PIN, LOW);
    digitalWrite(GREEN_PIN, LOW);

    if (!LittleFS.begin()) {
#if SERIAL_OUT == 1
        Serial.println(F("LittleFS mount failed!"));
        Serial.flush();
#endif
        while(true) {
            if (ledOnOff) {
                digitalWrite(BLUE_PIN, HIGH);
                ledOnOff = false;
            } else {
                digitalWrite(BLUE_PIN, LOW);
                ledOnOff = true;
            }
            delay(1000);
        }
    }

#if SERIAL_OUT == 1
    Serial.println(F("#### LittleFS ####"));
    Dir dir = LittleFS.openDir("/");
    while (dir.next()) {
        String fileName = dir.fileName();
        size_t fileSize = dir.fileSize();
        Serial.printf("FS File: %s, size: %s\n", fileName.c_str(), 
        formatBytes(fileSize));
    }
    Serial.printf("\n");
    Serial.flush();
#endif

    bmp.begin();

    sensors.begin();
    uint8_t deviceCount = sensors.getDeviceCount();

    for (uint8_t index = 0; index < deviceCount; index++) {
        sensors.getAddress(temperatureSensors[index], index);
    }

    ledOnOff = true;
    for (uint8_t t = 4; t > 0; t--) {
        if (ledOnOff) {
            digitalWrite(GREEN_PIN, HIGH);
            ledOnOff = false;
        } else {
            digitalWrite(GREEN_PIN, LOW);
            ledOnOff = true;
        }
#if SERIAL_OUT == 1
        Serial.printf("[SETUP] SECOND WAIT %d...\n", t);
        Serial.flush();
#endif
        delay(1000);
    }

    digitalWrite(GREEN_PIN, LOW);

    configTime(TIMEZONE_OFFSET_SEC, 0, NTP_SERVER);
#if SECURE_CLIENT == 1
    netClient.setTrustAnchors(&cert);
#else
    netClient.setInsecure();
#endif
    bot.updateToken(BOT_TOKEN);

#if SERIAL_OUT == 1
    Serial.print(F("Connecting to Wifi SSID "));
    Serial.print(SSID);
#endif
#if WIFI_POWER
    WiFi.setOutputPower(WIFI_POWER);
#endif

    connectWiFi();

    ArduinoOTA.setHostname("esp8266meteo");
    ArduinoOTA.begin();
    
    server.on("/list", HTTP_GET, handleFileList);
    server.on("/all", HTTP_GET, getAllData);
    server.on("/disk_usage", HTTP_GET, diskUsage);
    server.on("/logs_list", HTTP_GET, logsList);
    server.on("/clear_logs", HTTP_GET, clearLogs);
    server.on("/get_log", HTTP_GET, getLog);
    server.on("/edit", HTTP_DELETE, handleFileDelete);
    server.on("/edit", HTTP_POST,[](AsyncWebServerRequest *request) {
        request->send(200, "text/plain", "");
    },
    [](AsyncWebServerRequest *request, String filename, size_t index, uint8_t *data, size_t len, bool final) {
        static File uploadFile;
        if(index == 0) {
#if SERIAL_OUT == 1
            Serial.printf("UploadStart: %s\n", filename.c_str());
#endif
            if (!filename.startsWith("/")) filename = "/" + filename;
            if (LittleFS.exists(filename)) {
                LittleFS.remove(filename);
                char data[128];
                snprintf(data, sizeof(data), "{\"FL\":\"%s\"}", filename.c_str());
                toLog(SYS_LOG, "RM", data);
            }
            uploadFile = LittleFS.open(filename, "w");
        }
        if(uploadFile) {
            uploadFile.write(data, len);
        }
        if (final) {
#if SERIAL_OUT == 1
            Serial.printf("UploadEnd: %s (%u)\n", filename.c_str(), index + len);
#endif
            char data[128];
            snprintf(data, sizeof(data), "{\"FL\":\"%s\",\"SZ\":\"%d\"}", filename.c_str(), index + len);
            toLog(SYS_LOG, "UF", data); // UF File uploaded
            if (uploadFile) {
                uploadFile.close();
            }
        }
    });

    server.on("/inline", [](AsyncWebServerRequest *request) {
        request->send(200, "text/plain", "This works as well");
    });
    server.serveStatic("/", LittleFS, "/")
        .setDefaultFile("index.html")
        .setCacheControl(CACHE_MAX_AGE);

    server.begin();

#if SERIAL_OUT == 1
    Serial.println(F("HTTP server started"));
    Serial.print(F("\nWiFi connected. IP address: "));
    Serial.println(WiFi.localIP());
#endif

    myIP = WiFi.localIP();

#if SERIAL_OUT == 1
    Serial.print(F("Retrieving time: "));
#endif
    time_t now = time(nullptr);
    ledOnOff = false;
    while (now < 86400) {
        if (ledOnOff) {
            digitalWrite(GREEN_PIN, HIGH);
            ledOnOff = false;
        } else {
            digitalWrite(GREEN_PIN, LOW);
            ledOnOff = true;
        }
#if SERIAL_OUT == 1
        Serial.print(".");
#endif
        delay(200);
        now = time(nullptr);
    }

    digitalWrite(GREEN_PIN, LOW);
    digitalWrite(BLUE_PIN, LOW);

#if SERIAL_OUT == 1
    Serial.println(now);
#endif
    startTime = now;
    snprintf(startBuffer, sizeof(startBuffer), "%s", ctime(&startTime));
    startBuffer[strlen(startBuffer) - 1] = '\0';
    digitalWrite(GREEN_PIN, HIGH);
    greenLed = millis();

    rotateLogs();
    createLog(SYS_LOG);

    TrendTracker_init(&trendTemperature, TEMPERATURE_THRESHOLD);
    TrendTracker_init(&trendPressure, PRESSURE_THRESHOLD);
    TrendTracker_init(&trendHumidity, HUMIDITY_THRESHOLD);

    char data[128];
    rst_info* resetInfo = system_get_rst_info();
    snprintf(data, sizeof(data), "{\"M\":\"Reset reason: %s\"}", resetReasonToString(resetInfo->reason));
    toLog(SYS_LOG, "IN", data);
}

/*######################################################################################*/

void loop() {
    static unsigned long int botLastTime = 0;
    readData();
    MDNS.update();
    if (millis() - botLastTime > BOT_MTBS) {
        int numNewMessages = bot.getUpdates(bot.last_message_received + 1);
        while (numNewMessages) {
#if SERIAL_OUT == 1
            Serial.println(F("got response"));
#endif
            handleNewMessages(numNewMessages);
            numNewMessages = bot.getUpdates(bot.last_message_received + 1);
        }
        botLastTime = millis();
    }
    if (greenLed != 0 && (millis() - greenLed) > 60000) {
        digitalWrite(GREEN_PIN, LOW);
        greenLed = 0;
    }
    setThresholds();
    ArduinoOTA.handle();

}
